{"title":"3D Flattening Tools and Libs","slug":"3d-flattening","date":"2013-07-12T00:52:03.000Z","updated":"2018-04-21T08:18:25.482Z","comments":true,"path":"api/articles/3d-flattening.json","photos":[],"link":"","excerpt":"3DHISTORY.DE | by Thomas Schmid","covers":null,"content":"<ul>\n<li><a href=\"http://3dhistory.de/wordpress/\" target=\"_blank\" rel=\"noopener\">3DHISTORY.DE | by Thomas Schmid</a></li>\n</ul>\n<a id=\"more\"></a>\n<h2 id=\"Opensource-Software\"><a href=\"#Opensource-Software\" class=\"headerlink\" title=\"Opensource Software\"></a>Opensource Software</h2><ul>\n<li><a href=\"http://meshlab.sourceforge.net/\" target=\"_blank\" rel=\"noopener\">MeshLab</a></li>\n</ul>\n<blockquote>\n<p>MeshLab is an open source, portable, and extensible system for the processing and editing of unstructured 3D triangular meshes.</p>\n<p>The system is aimed to help the processing of the typical not-so-small unstructured models arising in 3D scanning, providing a set of tools for editing, cleaning, healing, inspecting, rendering and converting this kind of meshes.</p>\n<p>The system is heavily based on the VCG library developed at the Visual Computing Lab of ISTI - CNR, for all the core mesh processing tasks and it is available for Windows, MacOSX, and Linux. . The MeshLab system started in late 2005 as a part of the FGT course of the Computer Science department of University of Pisa and most of the code (~15k lines) of the first versions was written by a handful of willing students. The following years FGT students have continued to work to this project implementing more and more features. The proud MeshLab developers are listed here.<br>This project is actively supported by the 3D-CoForm project.<br>Other projects that have previously supported MeshLab are listed here.</p>\n</blockquote>\n<h2 id=\"Commercial-Software\"><a href=\"#Commercial-Software\" class=\"headerlink\" title=\"Commercial Software\"></a>Commercial Software</h2><ul>\n<li><a href=\"http://www.marvelousdesigner.com/marvelous/\" target=\"_blank\" rel=\"noopener\">Marvelous Designer 2</a></li>\n</ul>\n<blockquote>\n<h4 id=\"Intuitive-Pattern-Design\"><a href=\"#Intuitive-Pattern-Design\" class=\"headerlink\" title=\"Intuitive Pattern Design\"></a>Intuitive Pattern Design</h4><ul>\n<li>Support for full pattern design functions</li>\n</ul>\n<p>You can design accurate patterns only using Marvelous Designer without help of the other pattern CADs. Marvelous Designer supports for polyline, free curve and dart drawing. Create your own styles now.</p>\n<ul>\n<li>Synchronization of pattern editing and 3d draping for Interactive Design</li>\n</ul>\n<p>Any pattern modifications are completely and immediately reflected on the draping of 3D clothes in real-time. Experience the most intuitive and efficient clothes design interface in the world.</p>\n<h4 id=\"Easy-sewing-and-folding\"><a href=\"#Easy-sewing-and-folding\" class=\"headerlink\" title=\"Easy sewing and folding\"></a>Easy sewing and folding</h4><ul>\n<li>Easy-to-use sewing operations</li>\n</ul>\n<p>With only a few mouse works you can sew any patterns in any styles. See the animation below.</p>\n<ul>\n<li>Support for Tuck, Shirring, Pleat, Gather, Ironed line making</li>\n</ul>\n<p>Marvelous Designer supports for multi-layered sewing. With this feature you can make more complex designs like Tuck and Gather. Another key feature is the folding operation. You can make folds on any seams and clothes. The folding function enables us to make pleats and ironed lines.</p>\n<h4 id=\"Fast-and-Accurate-Draping\"><a href=\"#Fast-and-Accurate-Draping\" class=\"headerlink\" title=\"Fast and Accurate Draping\"></a>Fast and Accurate Draping</h4><ul>\n<li>The fastest draping speed</li>\n</ul>\n<p>You can experience fast and complete draping results for any complicated clothes. The improvements in speed and quality have been achieved by using a novel Multi-Level simulation which has been studied and developed in our team. Furthermore, parallelized algorithms bring more speed-ups with multi-core CPUs.</p>\n<ul>\n<li>Support for a variety of physical properties</li>\n</ul>\n<p>The physical characteristics of cloth are digitized and parametrized into a variety of properties - Stretching/ Shearing/Bending stiffness, Damping, Density, Thickness and so on. Controlling this parameters allows simulating various kinds of cloth materials.</p>\n<ul>\n<li>One-click pattern placement using “Arrangement Point”</li>\n</ul>\n<p>Marvelous Designer provides an easy way to arrange patterns around an avatar for draping. That is the ‘Arrangement Point’ which indicates the key position to place patterns. Only thing you need is to pick a pattern and to click “Arrangement Point” you want to place it on.</p>\n<h4 id=\"Realtime-Rendering\"><a href=\"#Realtime-Rendering\" class=\"headerlink\" title=\"Realtime Rendering\"></a>Realtime Rendering</h4><ul>\n<li>High-quality realtime rendering</li>\n</ul>\n<p>Our realtime renderer provides high-quality images comparable with real clothing. Look forward to more advanced features such as bump mapping, soft shadows and global illumination in future versions.</p>\n<h4 id=\"Wide-Compatibility\"><a href=\"#Wide-Compatibility\" class=\"headerlink\" title=\"Wide Compatibility\"></a>Wide Compatibility</h4><ul>\n<li>With 3D modeling tools</li>\n</ul>\n<p>Marvelous Designer can import any COLLADA and OBJ files from most of 3D modeling tools such as 3DS Max, Maya, SoftImage, LightWave, Poser, Daz Studio, Vue and Modo. And avatar and cloth files can be exported in OBJ format.</p>\n</blockquote>\n<ul>\n<li><a href=\"http://www.exactflat.com/3D-to-2D-CAD-Model-Flattening\" target=\"_blank\" rel=\"noopener\">ExactFlat</a></li>\n</ul>\n<blockquote>\n<p>ExactFlat is software for creating 2D flat surfaces from 3D CAD models.  It is unique because it was created to solve the problem of generating flat patterns from complex, non-developable surface CAD files.  For manufacturers in automotive, aerospace, marine, apparel, technical textiles, furniture and accessories working with fabrics, ExactFlat helps get products to market faster. - See more at: <a href=\"http://www.exactflat.com/3D-to-2D-CAD-Model-Flattening#sthash.AAhwZMZM.dpuf\" target=\"_blank\" rel=\"noopener\">http://www.exactflat.com/3D-to-2D-CAD-Model-Flattening#sthash.AAhwZMZM.dpuf</a></p>\n</blockquote>\n<ul>\n<li><a href=\"http://www.optitex.com/zh-hant/node/1134\" target=\"_blank\" rel=\"noopener\">3D Flattener</a></li>\n</ul>\n<blockquote>\n<p>Optitex enables on-screen transformation of three-dimensional objects’ surface into two-dimensional patterns that make up the draped object.</p>\n</blockquote>\n<h2 id=\"Other-Tools-and-Plugins\"><a href=\"#Other-Tools-and-Plugins\" class=\"headerlink\" title=\"Other Tools and Plugins\"></a>Other Tools and Plugins</h2><h3 id=\"Google-Sketchup-Related-Tools\"><a href=\"#Google-Sketchup-Related-Tools\" class=\"headerlink\" title=\"Google Sketchup Related Tools\"></a>Google Sketchup Related Tools</h3><ul>\n<li><p><a href=\"http://sketchuptips.blogspot.hk/2007/08/plugin-unfoldrb.html\" target=\"_blank\" rel=\"noopener\">Unfold Tool</a></p>\n</li>\n<li><p><a href=\"http://www.waybe.ca/index.html\" target=\"_blank\" rel=\"noopener\">Waybe</a></p>\n</li>\n</ul>\n<blockquote>\n<p>Waybe started off a simple MIT project inspired by a program called ‘Workshop’ which ran on the legendary IBM 5150.  Workshop let you printout pre-set paper cutouts which you then cutout, assembled, glued together and then proceeded to play with or admire or whatever.  We wanted to build something similar except that you could now also design your model rather than settling for whatever Workshop decided you should build.  Hence, Waybe’s purpose in life is to help you design, unfold, printout and build paper models.  Be nice to Waybe, and Waybe will be nice to you.</p>\n</blockquote>\n<h2 id=\"Discussion-Thread\"><a href=\"#Discussion-Thread\" class=\"headerlink\" title=\"Discussion Thread\"></a>Discussion Thread</h2><ul>\n<li><a href=\"http://www.3dmd.net/forum/3d-discussion-6379.html\" target=\"_blank\" rel=\"noopener\">Flattening/unfolding a low poly model in sketchup</a></li>\n</ul>\n<h2 id=\"Related-Code\"><a href=\"#Related-Code\" class=\"headerlink\" title=\"Related Code\"></a>Related Code</h2><ul>\n<li><a href=\"http://insight3d.sourceforge.net/\" target=\"_blank\" rel=\"noopener\">insight3d </a></li>\n</ul>\n<blockquote>\n<p>insight3d lets you create 3D models from photographs. You give it a series of photos of a real scene (e.g., of a building), it automatically matches them and then calculates positions in space from which each photo has been taken (plus camera’s optical parameters) along with a 3D pointcloud of the scene. You can then use insight3d’s modeling tools to create textured polygonal model.</p>\n<p>Basically, it hopes to be “Photosynth + Canoma”. Or “boujou + Imagemodeler”. But it’s also free and opensource (GNU AGPL 3). Check out the screenshots below or download it already.</p>\n</blockquote>\n","categories":[{"name":"academic","slug":"academic","count":8,"path":"api/categories/academic.json"}],"tags":[{"name":"3d","slug":"3d","count":1,"path":"api/tags/3d.json"}]}